# Part 3

For part 3 of the project you will be practicing applying an E.T.L process on your previously saved movie data. Specifically, you will create a new MySQL database after preparing the data for a relational database. You will export your database to a .sql file in your repository using MySQL Workbench.

## Specifications - Database
Your stakeholder wants you to take the data you have been cleaning and collecting in Parts 1 & 2 of the project and wants you to create a MySQL database for them.

Specifically, they want the data from the following files included in your database:
- Title Basics:
 - Movie ID (tconst)
 - Primary Title
 - Start Year
 - Runtime (in Minutes)
 - Genres
- Title Ratings
 - Movie ID (tconst)
 - Average Movie Rating
 - Number of Votes
- The TMDB API Results (multiple files)
 - Movie ID
 - Revenue
 - Budget
 - Certification (MPAA Rating)

You should normalize the tables as best you can before adding them to your new database.

- Note: an important exception to their request is that they would like you to keep all of the data from the TMDB API in 1 table together (even though it will not be perfectly normalized).
- You only need to keep the imdb_id, revenue, budget, and certification columns

## Required Transformation Steps for Title Basics:
Normalize Genre:

Convert the single string of genres from title basics into 2 new tables.
- title_genres:
 - tconst
 - genre_id

- genres:
 - genre_id
 - genre_name

Discard unnecessary information:

- For the title basics table, drop the following columns:
 - "original_title" (we will use the primary title column instead)
 - "isAdult" ("Adult" will show up in the genres so this is redundant information).
 - "titleType" (every row will be a movie).
 - "genres" and other variants of genre (genre is now represented in the 2 new tables described above.
- Do not include the title_akas table in your SQL database.
 - You have already filtered out the desired movies using this table, and the remaining data is mostly nulls and not of interest to the stakeholder.

## MySQL Database Requirements
- Use sqlalchemy with Pandas to execute your SQL queries inside your notebook.

- Create a new database on your MySQL server and call it "movies."

- Make sure to have the following tables in your "movies" database:

 - title_basics
 - title_ratings
 - title_genres
 - genres
 - tmdb_data

- Make sure to set a Primary Key for each table that isn't a joiner table (e.g., title_genres is a joiner table).

- After creating each table, show the first 5 rows of that table using a SQL query.

- Make sure to run the "SHOW TABLES" SQL query at the end of your notebook to show that all required tables have been created.

# Imports

In [1]:
import pandas as pd
import json
import pymysql
pymysql.install_as_MySQLdb()
from urllib.parse import quote_plus
from sqlalchemy.types import *
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists

# Normalizing Genres

In [2]:
title_basics = pd.read_csv('Data/title_basics.csv.gz')
title_basics.head() # read in dataframe

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance"
1,tt0043139,movie,Life of a Beijing Policeman,Wo zhe yi bei zi,0,2013,NaN,120,"Drama,History"
2,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020,NaN,70,Drama
3,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama
4,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi"

## Getting a List of Unique Genres

In [3]:
## create a col with a list of genres
title_basics['genres_split'] = title_basics['genres'].str.split(',')
title_basics

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0043139,movie,Life of a Beijing Policeman,Wo zhe yi bei zi,0,2013,NaN,120,"Drama,History","[Drama, History]"
2,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020,NaN,70,Drama,[Drama]
3,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama,[Drama]
4,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi","[Comedy, Horror, Sci-Fi]"
...,...,...,...,...,...,...,...,...,...,...
86750,tt9914942,movie,Life Without Sara Amat,La vida sense la Sara Amat,0,2019,NaN,74,Drama,[Drama]
86751,tt9915872,movie,The Last White Witch,My Girlfriend is a Wizard,0,2019,NaN,97,"Comedy,Drama,Fantasy","[Comedy, Drama, Fantasy]"
86752,tt9916170,movie,The Rehearsal,O Ensaio,0,2019,NaN,51,Drama,[Drama]
86753,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,95,"Action,Adventure,Thriller","[Action, Adventure, Thriller]"
86754,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History","[Drama, History]"

In [4]:
exploded_genres = title_basics.explode('genres_split')
exploded_genres

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Romance
1,tt0043139,movie,Life of a Beijing Policeman,Wo zhe yi bei zi,0,2013,NaN,120,"Drama,History",Drama
1,tt0043139,movie,Life of a Beijing Policeman,Wo zhe yi bei zi,0,2013,NaN,120,"Drama,History",History
...,...,...,...,...,...,...,...,...,...,...
86753,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,95,"Action,Adventure,Thriller",Action
86753,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,95,"Action,Adventure,Thriller",Adventure
86753,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,95,"Action,Adventure,Thriller",Thriller
86754,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History",Drama
86754,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History",History

In [5]:
unique_genres = sorted(exploded_genres['genres_split'].unique())
unique_genres

['Action',
 'Adult',
 'Adventure',
 'Animation',
 'Biography',
 'Comedy',
 'Crime',
 'Drama',
 'Family',
 'Fantasy',
 'Game-Show',
 'History',
 'Horror',
 'Music',
 'Musical',
 'Mystery',
 'News',
 'Reality-TV',
 'Romance',
 'Sci-Fi',
 'Sport',
 'Talk-Show',
 'Thriller',
 'War',
 'Western']

# Create `title_genres` Table

In [6]:
# Save just tconst and genres_slpit as new dataframe
title_genres = exploded_genres[['tconst', 'genres_split']].copy()

## Create a genre mapper dictionary

In [7]:
## Making the genre mapper dictionary
genre_ints = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_ints))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Sport': 20,
 'Talk-Show': 21,
 'Thriller': 22,
 'War': 23,
 'Western': 24}

In [8]:
# Make a dictionary with a list of unique genres as the key and the new integer id as values
genre_id_map = dict(zip(unique_genres, range(len(unique_genres))))
genre_id_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Sport': 20,
 'Talk-Show': 21,
 'Thriller': 22,
 'War': 23,
 'Western': 24}

## Replace the string genres in title_genres with the new integer ids

In [9]:
## make new integer genre_id and drop string genres
title_genres['genre_id'] = title_genres['genres_split'].map(genre_map)
title_genres = title_genres.drop(columns='genres_split')
title_genres

          tconst  genre_id
0      tt0035423         5
0      tt0035423         9
0      tt0035423        18
1      tt0043139         7
1      tt0043139        11
...          ...       ...
86753  tt9916190         0
86753  tt9916190         2
86753  tt9916190        22
86754  tt9916362         7
86754  tt9916362        11

[162080 rows x 2 columns]

# Create `genres` Table

In [10]:
# Manually make dataframe with named columns from the key/value pairs
genres = pd.DataFrame({'genre_id': genre_map.values(),
                             'genre_name': genre_map.keys()})

genres.head()

   genre_id genre_name
0         0     Action
1         1      Adult
2         2  Adventure
3         3  Animation
4         4  Biography

# Create `title_basics` Table

In [11]:
title_basics.columns

Index(['tconst', 'titleType', 'primaryTitle', 'originalTitle', 'isAdult',
       'startYear', 'endYear', 'runtimeMinutes', 'genres', 'genres_split'],
      dtype='object')

In [12]:
keep_these = ['tconst', 'primaryTitle', 'startYear', 'runtimeMinutes']
title_basics = title_basics[keep_these]
title_basics.head()

,tconst,primaryTitle,startYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001,118
1,tt0043139,Life of a Beijing Policeman,2013,120
2,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,70
3,tt0069049,The Other Side of the Wind,2018,122
4,tt0088751,The Naked Monster,2005,100

# Create `tmdb_data` Table

In [13]:
tmdb_data = pd.read_csv('Data/tmdb_results_combined.csv.gz')
tmdb_data.head()

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,tt0113026,0.0,/vMFs7nw6P0bIV1jDsQpxAieAVnH.jpg,NaN,10000000.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10402, '...",NaN,62127.0,en,The Fantasticks,...,0.0,86.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Try to remember the first time magic happened,The Fantasticks,0.0,5.500,22.0,NaN
1,tt0118694,0.0,/n4GJFGzsc7NinI1VeGDXIcQjtU2.jpg,"{'id': 1131062, 'name': 'Wong Kar-Wai’s Love T...",150000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 10749, 'n...",NaN,843.0,cn,花樣年華,...,14204632.0,99.0,"[{'english_name': 'Cantonese', 'iso_639_1': 'c...",Released,"Feel the heat, keep the feeling burning, let t...",In the Mood for Love,0.0,8.112,2221.0,PG
2,tt0119273,0.0,/f5C03doOWiauu37bToKXtpgP5bS.jpg,"{'id': 141086, 'name': 'Heavy Metal Collection...",15000000.0,"[{'id': 28, 'name': 'Action'}, {'id': 12, 'nam...",NaN,16225.0,en,Heavy Metal 2000,...,0.0,88.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,not to survive the fight in the external world...,Heavy Metal 2000,0.0,6.100,181.0,R
3,tt0120263,0.0,/ynXVuylP8upazjz8lrqb1PEMkdR.jpg,NaN,0.0,"[{'id': 18, 'name': 'Drama'}, {'id': 35, 'name...",NaN,34070.0,sv,Sånger från andra våningen,...,80334.0,99.0,"[{'english_name': 'Russian', 'iso_639_1': 'ru'...",Released,NaN,Songs from the Second Floor,0.0,7.200,239.0,NaN
4,tt0120467,0.0,/knok3mNReKqPTplnnqz7E4dd7mD.jpg,NaN,120000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 27, 'name...",NaN,19085.0,en,Vulgar,...,14904.0,87.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Everyone loves a clown... some more than others.,Vulgar,0.0,5.500,44.0,R

In [14]:
tmdb_data.columns

Index(['imdb_id', 'adult', 'backdrop_path', 'belongs_to_collection', 'budget',
       'genres', 'homepage', 'id', 'original_language', 'original_title',
       'overview', 'popularity', 'poster_path', 'production_companies',
       'production_countries', 'release_date', 'revenue', 'runtime',
       'spoken_languages', 'status', 'tagline', 'title', 'video',
       'vote_average', 'vote_count', 'certification'],
      dtype='object')

In [15]:
keep_these = ['imdb_id', 'budget', 'revenue', 'certification']
tmdb_data = tmdb_data[keep_these]
tmdb_data.head()

     imdb_id      budget     revenue certification
0  tt0113026  10000000.0         0.0           NaN
1  tt0118694    150000.0  14204632.0            PG
2  tt0119273  15000000.0         0.0             R
3  tt0120263         0.0     80334.0           NaN
4  tt0120467    120000.0     14904.0             R

# Create `title_ratings` Table

In [16]:
title_ratings = pd.read_csv('Data/title_ratings.csv.gz')
title_ratings.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1978
1  tt0000002            5.8       265
2  tt0000005            6.2      2621
3  tt0000006            5.1       182
4  tt0000007            5.4       821

# Save Tables to MySQL Database

In [17]:
with open('/Users/jasontracey/.secret/mysql.json') as f: #change the path to match YOUR path!!
    login = json.load(f)
login.keys()

dict_keys(['username', 'password'])

In [18]:
# Create mySQL connection
username = "root"
password = quote_plus(login['password'])
db_name = "Movie Profitability"
connection = f"mysql+pymysql://{username}:{password}@localhost/{db_name}"

In [19]:
# create engine
engine = create_engine(connection)

In [20]:
# create new database if doesn't exist
if database_exists(connection) == False:
    create_database(connection)
    print('Database created.')
else:
    print("The database already exists.")

The database already exists.

## Save `title_basics` Table

In [21]:
## get max string length
max_str_len = title_basics['tconst'].fillna('').map(len).max()
max_str_len

10

In [22]:
## Calculate max string lengths for object columns
key_len = title_basics['tconst'].fillna('').map(len).max()
title_len = title_basics['primaryTitle'].fillna('').map(len).max()

## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "tconst": String(key_len+1), 
    "primaryTitle": Text(title_len+1),
    'startYear':Float(),
    'endYear':Float(),
    'runtimeMinutes':Integer()}

In [23]:
# Save to sql with dtype and index = False
title_basics.to_sql('title_basics', engine, dtype = df_schema, 
              if_exists = 'replace', index = False)

86755

In [24]:
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')

## Save `title_ratings` Table

In [25]:
## get max string length
max_str_len = title_ratings['tconst'].fillna('').map(len).max()
max_str_len

10

In [26]:
## Calculate max string lengths for object columns
key_len = title_ratings['tconst'].fillna('').map(len).max()

## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "tconst": String(key_len+1), 
    'averageRating':Float(),
    'numVotes':Float()}

In [27]:
# Save to sql with dtype and index = False
title_ratings.to_sql('title_ratings', engine, dtype = df_schema, 
              if_exists = 'replace', index = False)

500607

In [28]:
engine.execute('ALTER TABLE title_ratings ADD PRIMARY KEY (`tconst`);')

## Save `title_genres` Table

In [29]:
## get max string length
max_str_len = title_genres['tconst'].fillna('').map(len).max()
max_str_len

10

In [30]:
## Calculate max string lengths for object columns
key_len = title_genres['tconst'].fillna('').map(len).max()

## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "tconst": String(key_len+1), 
    'genre_id':Float()}

In [31]:
# Save to sql with dtype and index = False
title_genres.to_sql('title_genres', engine, dtype = df_schema, 
              if_exists = 'replace', index = False)

162080

## Save `genres` Table

In [32]:
## get max string length
max_str_len = genres['genre_name'].fillna('').map(len).max()
max_str_len

10

In [33]:
## Calculate max string lengths for object columns
key_len = genres['genre_name'].fillna('').map(len).max()

## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "genre_name": String(key_len+1), 
    'genre_id':Float()}

In [34]:
# Save to sql with dtype and index = False
genres.to_sql('genres', engine, dtype = df_schema, 
              if_exists = 'replace', index = False)

25

In [35]:
engine.execute('ALTER TABLE genres ADD PRIMARY KEY (`genre_id`);')

## Save `tmdb_data` Table

In [36]:
## get max string length
max_str_len = tmdb_data['imdb_id'].fillna('').map(len).max()
max_str_len

9

In [37]:
## Calculate max string lengths for object columns
key_len = tmdb_data['imdb_id'].fillna('').map(len).max()
cert_len = tmdb_data['certification'].fillna('').map(len).max()

## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "imdb_id": String(key_len+1), 
    "certification": Text(cert_len+1),
    'budget':Float(),
    'revenue':Float()}

In [38]:
# Save to sql with dtype and index = False
tmdb_data.to_sql('tmdb_data', engine, dtype = df_schema, 
              if_exists = 'replace', index = False)

638

In [39]:
engine.execute('ALTER TABLE tmdb_data ADD PRIMARY KEY (`imdb_id`);')

# Show first 5 entries in each table

In [40]:
q = """
SELECT * 
FROM title_basics
LIMIT 5;
"""

pd.read_sql(q, engine)

,tconst,primaryTitle,startYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001.0,118
1,tt0043139,Life of a Beijing Policeman,2013.0,120
2,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70
3,tt0069049,The Other Side of the Wind,2018.0,122
4,tt0088751,The Naked Monster,2005.0,100

In [41]:
q = """
SELECT * 
FROM title_ratings
LIMIT 5;
"""

pd.read_sql(q, engine)

      tconst  averageRating  numVotes
0  tt0000001            5.7    1978.0
1  tt0000002            5.8     265.0
2  tt0000005            6.2    2621.0
3  tt0000006            5.1     182.0
4  tt0000007            5.4     821.0

In [42]:
q = """
SELECT * 
FROM title_genres
LIMIT 5;
"""

pd.read_sql(q, engine)

      tconst  genre_id
0  tt0035423       5.0
1  tt0035423       9.0
2  tt0035423      18.0
3  tt0043139       7.0
4  tt0043139      11.0

In [43]:
q = """
SELECT * 
FROM genres
LIMIT 5;
"""

pd.read_sql(q, engine)

   genre_id genre_name
0       0.0     Action
1       1.0      Adult
2       2.0  Adventure
3       3.0  Animation
4       4.0  Biography

In [44]:
q = """
SELECT * 
FROM tmdb_data
LIMIT 5;
"""

pd.read_sql(q, engine)

     imdb_id      budget     revenue certification
0  tt0035423  48000000.0  76019000.0         PG-13
1  tt0113026  10000000.0         0.0          None
2  tt0118589  22000000.0   5271670.0         PG-13
3  tt0118652   1000000.0         0.0             R
4  tt0118694    150000.0  14204600.0            PG

# Show Tables in MySQL

In [45]:
# check with query
q = """
SHOW TABLES;
"""

pd.read_sql(q, engine)

  Tables_in_movie profitability
0                        genres
1                  title_basics
2                  title_genres
3                 title_ratings
4                     tmdb_data